CPE 434 & 435/Lab_10/%5c(1)

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wst="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:mex="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:PNPX="http://schemas.microsoft.com/windows/pnpx/2005/10" xmlns:UNS1="http://www.microsoft.com/windows/test/testdevice/11/2005" xmlns:dd="http://www.hp.com/schemas/imaging/con/dictionaries/1.0" xmlns:df="http://schemas.microsoft.com/windows/2008/09/devicefoundation"  xmlns:wsdp="http://schemas.xmlsoap.org/ws/2006/02/devprof" xmlns:wprt="http://schemas.microsoft.com/windows/2006/08/wdp/print" xmlns:wscn="http://schemas.microsoft.com/windows/2006/08/wdp/scan" xmlns:hpd="http://www.hp.com/schemas/imaging/con/discovery/2006/09/19" xmlns:ledm="http://www.hp.com/schemas/imaging/con/ledm/discoverytree/2007/07/01" xmlns:jobcapabilities="http://www.hp.com/schemas/imaging/img/ijc/2007/05/04"><SOAP-ENV:Header><wsa:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:To><wsa:Action>http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse</wsa:Action><wsa:MessageID>urn:uuid:92ced7a9-302e-1f3b-9d9a-c01803530bde</wsa:MessageID><wsa:RelatesTo>urn:uuid:b62c8eb6-cbd8-4cf6-967f-74813e81bf57</wsa:RelatesTo></SOAP-ENV:Header><SOAP-ENV:Body><mex:Metadata><mex:MetadataSection Dialect="http://schemas.xmlsoap.org/ws/2006/02/devprof/ThisDevice"><wsdp:ThisDevice><wsdp:FriendlyName xml:lang="en">NPI530BDE (HP LaserJet MFP M140w)</wsdp:FriendlyName><wsdp:FirmwareVersion>20221107</wsdp:FirmwareVersion><wsdp:SerialNumber>VND4921585</wsdp:SerialNumber></wsdp:ThisDevice></mex:MetadataSection><mex:MetadataSection Dialect="http://schemas.xmlsoap.org/ws/2006/02/devprof/ThisModel"><wsdp:ThisModel><wsdp:Manufacturer xml:lang="en">HP</wsdp:Manufacturer><wsdp:ManufacturerUrl>http://www.hp.com/</wsdp:ManufacturerUrl><wsdp:ModelName xml:lang="en">HP LaserJet MFP M140w</wsdp:ModelName><wsdp:ModelNumber>MFP M140w</wsdp:ModelNumber><wsdp:ModelUrl>http://www.hp.com/support/ljM139MFP</wsdp:ModelUrl><wsdp:PresentationUrl>http://192.168.0.5:80/</wsdp:PresentationUrl><PNPX:DeviceCategory>Printers MFP Scanners MobilePrinter</PNPX:DeviceCategory><df:DeviceCategory>PrintFax.MFP PrintFax.Printers.Laser Imaging.Scanner</df:DeviceCategory></wsdp:ThisModel></mex:MetadataSection><mex:MetadataSection Dialect="http://schemas.xmlsoap.org/ws/2006/02/devprof/Relationship"><wsdp:Relationship Type="http://schemas.xmlsoap.org/ws/2006/02/devprof/host"><wsdp:Hosted><wsa:EndpointReference><wsa:Address>http://192.168.0.5:3910/</wsa:Address><wsa:ReferenceProperties><UNS1:ServiceIdentifier>uri:prn</UNS1:ServiceIdentifier></wsa:ReferenceProperties></wsa:EndpointReference><wsa:EndpointReference><wsa:Address>http://[2604:2d80:b404:f000::e0a]:3910/</wsa:Address><wsa:ReferenceProperties><UNS1:ServiceIdentifier>uri:prn</UNS1:ServiceIdentifier></wsa:ReferenceProperties></wsa:EndpointReference><wsa:EndpointReference><wsa:Address>http://[2604:2d80:b404:f000:c218:3ff:fe53:bde]:3910/</wsa:Address><wsa:ReferenceProperties><UNS1:ServiceIdentifier>uri:prn</UNS1:ServiceIdentifier></wsa:ReferenceProperties></wsa:EndpointReference><wsa:EndpointReference><wsa:Address>http://[fe80::c218:3ff:fe53:bde]:3910/</wsa:Address><wsa:ReferenceProperties><UNS1:ServiceIdentifier>uri:prn</UNS1:ServiceIdentifier></wsa:ReferenceProperties></wsa:EndpointReference><wsdp:Types>wprt:PrinterServiceType</wsdp:Types><wsdp:ServiceId>http://www.hp.com/schemas/imaging/con/wsprint/2007/05/hp_wsprint.wsdl</wsdp:ServiceId><PNPX:HardwareId>VEN_03F0&amp;DEV_MFP_M140W&amp;SUBSYS_01&amp;REV_20221107 VEN_03F0&amp;DEV_MFP_M140W&amp;SUBSYS_01 VEN_03F0&amp;DEV_MFP_M140W</PNPX:HardwareId><PNPX:CompatibleId>http://schemas.microsoft.com/windows/2006/08/wdp/print/PrinterServiceType</PNPX:CompatibleId></wsdp:Hosted><wsdp:Hosted><wsa:EndpointReference><wsa:Address>http://192.168.0.5:53048/</wsa:Address><wsa:ReferenceProperties><UNS1:ServiceIdentifier>uri:scn</UNS1:ServiceIdentifier></wsa:ReferenceProperties></wsa:EndpointReference><wsa:EndpointReference><wsa:Address>http://[2604:2d80:b404:f000::e0a]:53048/</wsa:Address><wsa:ReferenceProperties><UNS1:ServiceIdentifier>uri:scn</UNS1:ServiceIdentifier></wsa:ReferenceProperties></wsa:EndpointReference><wsa:EndpointReference><wsa:Address>http://[2604:2d80:b404:f000:c218:3ff:fe53:bde]:53048/</wsa:Address><wsa:ReferenceProperties><UNS1:ServiceIdentifier>uri:scn</UNS1:ServiceIdentifier></wsa:ReferenceProperties></wsa:EndpointReference><wsa:EndpointReference><wsa:Address>http://[fe80::c218:3ff:fe53:bde]:53048/</wsa:Address><wsa:ReferenceProperties><UNS1:ServiceIdentifier>uri:scn</UNS1:ServiceIdentifier></wsa:ReferenceProperties></wsa:EndpointReference><wsdp:Types>wscn:ScannerServiceType</wsdp:Types><wsdp:ServiceId>uri:1cd4F16e-8668-a7a0-4497-0014deadbeef/Scanner1</wsdp:ServiceId><PNPX:HardwareId>VEN_03F0&amp;DEV_MFP_M140W&amp;SUBSYS_11&amp;REV_20221107 VEN_03F0&amp;DEV_MFP_M140W&amp;SUBSYS_11 VEN_03F0&amp;DEV_MFP_M140W</PNPX:HardwareId><PNPX:CompatibleId>http://schemas.microsoft.com/windows/2006/08/wdp/scan/ScannerServiceType</PNPX:CompatibleId></wsdp:Hosted><wsdp:Hosted><wsa:EndpointReference><wsa:Address>http://192.168.0.5:8080/DevMgmt/DiscoveryTree.xml</wsa:Address></wsa:EndpointReference><wsa:EndpointReference><wsa:Address>http://[2604:2d80:b404:f000::e0a]:8080/DevMgmt/DiscoveryTree.xml</wsa:Address></wsa:EndpointReference><wsa:EndpointReference><wsa:Address>http://[2604:2d80:b404:f000:c218:3ff:fe53:bde]:8080/DevMgmt/DiscoveryTree.xml</wsa:Address></wsa:EndpointReference><wsa:EndpointReference><wsa:Address>http://[fe80::c218:3ff:fe53:bde]:8080/DevMgmt/DiscoveryTree.xml</wsa:Address></wsa:EndpointReference><wsdp:Types>ledm:hpLedmDiscoveryTree</wsdp:Types><wsdp:ServiceId>http://www.hp.com/schemas/imaging/con/ledm/discoverytree/2007/07/01</wsdp:ServiceId></wsdp:Hosted><wsdp:Hosted><wsa:EndpointReference><wsa:Address>http://192.168.0.5:80/hp/device/JobCapabilities/JobCapabilitiesTicket.zip</wsa:Address></wsa:EndpointReference><wsa:EndpointReference><wsa:Address>http://[2604:2d80:b404:f000::e0a]:80/hp/device/JobCapabilities/JobCapabilitiesTicket.zip</wsa:Address></wsa:EndpointReference><wsa:EndpointReference><wsa:Address>http://[2604:2d80:b404:f000:c218:3ff:fe53:bde]:80/hp/device/JobCapabilities/JobCapabilitiesTicket.zip</wsa:Address></wsa:EndpointReference><wsa:EndpointReference><wsa:Address>http://[fe80::c218:3ff:fe53:bde]:80/hp/device/JobCapabilities/JobCapabilitiesTicket.zip</wsa:Address></wsa:EndpointReference><wsdp:Types>jobcapabilities:hpJobCapabilitiesDiscoveryTree</wsdp:Types><wsdp:ServiceId>http://www.hp.com/schemas/imaging/img/ijc/2007/05/04</wsdp:ServiceId></wsdp:Hosted></wsdp:Relationship></mex:MetadataSection></mex:Metadata></SOAP-ENV:Body></SOAP-ENV:Envelope>